In [1]:
import pandas as pd

In [2]:
dados = {
    'nome': ['Ana', 'Bia', 'Carlos', 'Daniel'],
    'idade': [23, 34, 45, 56],
    'cidade': ['São Paulo', 'Rio de Janeiro', 'Belo Horizonte', 'Curitiba']
}

In [3]:
df = pd.DataFrame(dados)
# Criando um DataFrame a partir de um dicionário

In [4]:
df # Exibindo o DataFrame df é variavel que armazena o DataFrame

     nome  idade          cidade
0     Ana     23       São Paulo
1     Bia     34  Rio de Janeiro
2  Carlos     45  Belo Horizonte
3  Daniel     56        Curitiba

In [5]:
df.head(1) # Exibindo as 5 primeiras linhas do DataFrame,
 # () sem argumentos, o método head() exibe as 5 primeiras linhas do DataFrame

  nome  idade     cidade
0  Ana     23  São Paulo

In [6]:
df.tail(1) # Exibindo as 2 últimas linhas do DataFrame
# tail é o oposto de head, ou seja, exibe as últimas linhas do DataFrame

     nome  idade    cidade
3  Daniel     56  Curitiba

In [7]:
dados_notas ={
    'Nome': ['Ana', 'Bia', 'Carlos', 'Daniel'],
    'Matematica': [9, 8, 7, 6],
    'Fisica': [7, 8, 9, 6],
    'Quimica': [8, 9, 7, 6]
}

In [8]:
df_notas = pd.DataFrame(dados_notas)

In [9]:
df_notas

     Nome  Matematica  Fisica  Quimica
0     Ana           9       7        8
1     Bia           8       8        9
2  Carlos           7       9        7
3  Daniel           6       6        6

In [10]:
#Calculando a media das notas
df_notas

     Nome  Matematica  Fisica  Quimica
0     Ana           9       7        8
1     Bia           8       8        9
2  Carlos           7       9        7
3  Daniel           6       6        6

In [11]:
df_notas['Média'] = (df_notas['Matematica'] + df_notas['Fisica'] + df_notas['Quimica']) / 3
#Escreva CERTO o nome das colunas, se não, não puxa
df_notas

     Nome  Matematica  Fisica  Quimica     Média
0     Ana           9       7        8  8.000000
1     Bia           8       8        9  8.333333
2  Carlos           7       9        7  7.666667
3  Daniel           6       6        6  6.000000

In [12]:
#Identificar alunos aprovados com nota boa (precisa ser maior media >=82.5)
df_notas_aprovados = df_notas[df_notas['Média'] >= 8]
df_notas_aprovados

  Nome  Matematica  Fisica  Quimica     Média
0  Ana           9       7        8  8.000000
1  Bia           8       8        9  8.333333

In [13]:
df_notas [['Nome', 'Média']]

     Nome     Média
0     Ana  8.000000
1     Bia  8.333333
2  Carlos  7.666667
3  Daniel  6.000000

In [14]:
df_notas_aprovados [['Nome','Média']]

  Nome     Média
0  Ana  8.000000
1  Bia  8.333333